src/DataProcessors/ЗагрузкаДанныхБух.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаДанныхБух</Name>
			<Comment>Загрузка данных из бухгалтерии</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>XMLФорматВыгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БД_ТС</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БылоСозданиеНовогоПоля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремБДДоков</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремБДОбъектов</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремБДТаблиц</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбДатаНачалаДляДоговоров</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбКонтрагентВзносНаличнымиВБанк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбКонтрагентВыдачаДенежныхСредствПодотчетнику</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбКонтрагентВыплатаЗаработнойПлаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбКонтрагентИнкассацияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбКонтрагентПереводСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбКонтрагентПеречислениеНалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбКонтрагентПриемРозничнойВыручки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбКонтрагентПрочее</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбСтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКраткийОтчетОЗагрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПолныйОтчетОЗагрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПолеDirect</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПолеUpdate</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженоДок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженоСпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаВремБДДоков</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаВремБДОбъектов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаВремБДТаблиц</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаИндексовТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВидОплатыДляВсех</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентОрг</Name>
					<Comment>Контрагент организации, по которой производится загрузка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>кУР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьРарусБухгалтерия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьРарусБухгалтерияДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьСуществующие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСоздаватьНовыхКонтрагентов</Name>
					<Comment>Если при загрузке не получено соответствие, то запретить создавать новые  элементы справочников контрагентов и организаций. Загрузка будет остановлена.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереноситьНомераВсехДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказатьЗагруженные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходРознВырНаименованиеСтатьи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьДокументы</Name>
					<Comment>Флаг проведение документов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствиеМенеджеров</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствияОбъектов</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлВыгрузкиИзV8</Name>
					<Comment>Путь к файлу для выгрузки из 8 версии</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флЗагрузкаИзБП2</Name>
					<Comment>Флаг загрузки данных из "Бухгалтерии КОРП" или "Бухгалтерии 2.0"</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКлиент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ЗагрузкаДанныхБух/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

Перем ФайлЗагрузки;

#КонецОбласти

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Функция РазобратьСтрокуНаСервере(Строка)
	
	Возврат Обработки.ЗагрузкаДанныхБух.РазобратьСтроку(Строка);
	
КонецФункции

&НаСервере
Функция ОчиститьСпецСимволыНаСервере(Значение)
	
	Обработки.ЗагрузкаДанныхБух.ОчиститьСпецСимволы(Значение);
	
КонецФункции

// Функция выполняет проверку заполнения основных реквизитов
&НаСервере
Функция ПроверитьЗаполнениеРеквизитов()
	
	Отказ = Ложь;
	Если Объект.ВыбПодразделение.Пустая() Тогда
		НовоеСообщение = СписокСообщений.Добавить();
		НовоеСообщение.Сообщение = НСтр("ru = 'Не заполнено подразделение компании для подстановки.'");
		НовоеСообщение.Поле      = "Объект.ВыбПодразделение";
		Отказ = Истина;
	КонецЕсли;
	Если Объект.ВыбКасса.Пустая() Тогда
		НовоеСообщение = СписокСообщений.Добавить();
		НовоеСообщение.Сообщение = НСтр("ru = 'Не заполнена касса для подстановки.'");
		НовоеСообщение.Поле      = "Объект.ВыбКасса";
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ВыбДатаНачалаДляДоговоров) Тогда
		НовоеСообщение = СписокСообщений.Добавить();
		НовоеСообщение.Сообщение = НСтр("ru = 'Не заполнено значение даты начала для подстановки в загружаемые договора.'");
		НовоеСообщение.Поле      = "Объект.ВыбДатаНачалаДляДоговоров";
		Отказ = Истина;
	КонецЕсли;
	Если Объект.ВыбКонтрагентПриемРозничнойВыручки.Пустая() Тогда
		НовоеСообщение = СписокСообщений.Добавить();
		НовоеСообщение.Сообщение = НСтр("ru = 'Не заполнен контрагент ""Прием розничной выручки"".'");
		НовоеСообщение.Поле      = "Объект.ВыбКонтрагентПриемРозничнойВыручки";
		Отказ = Истина;
	КонецЕсли;
	Если Объект.ВыбКонтрагентВыдачаДенежныхСредствПодотчетнику.Пустая() Тогда
		НовоеСообщение = СписокСообщений.Добавить();
		НовоеСообщение.Сообщение = НСтр("ru = 'Не заполнен контрагент ""выдача ден. средств подотчетнику"".'");
		НовоеСообщение.Поле      = "Объект.ВыбКонтрагентВыдачаДенежныхСредствПодотчетнику";
		Отказ = Истина;
	КонецЕсли;
	Если Объект.ВыбКонтрагентВзносНаличнымиВБанк.Пустая() Тогда
		НовоеСообщение = СписокСообщений.Добавить();
		НовоеСообщение.Сообщение = НСтр("ru = 'Не заполнен контрагент ""взнос наличными в банк"".'");
		НовоеСообщение.Поле      = "Объект.ВыбКонтрагентВзносНаличнымиВБанк";
		Отказ = истина;
	КонецЕсли;
	Если Объект.ВыбКонтрагентВыплатаЗаработнойПлаты.Пустая() Тогда
		НовоеСообщение = СписокСообщений.Добавить();
		НовоеСообщение.Сообщение = НСтр("ru = 'Не заполнен контрагент ""выплата заработной платы"".'");
		НовоеСообщение.Поле      = "Объект.ВыбКонтрагентВыплатаЗаработнойПлаты";
		Отказ = Истина;
	КонецЕсли;
	Если Объект.ВыбКонтрагентИнкассацияДенежныхСредств.Пустая() Тогда
		НовоеСообщение = СписокСообщений.Добавить();
		НовоеСообщение.Сообщение = НСтр("ru = 'Не заполнен контрагент ""инкассация денежных средств"".'");
		НовоеСообщение.Поле      = "Объект.ВыбКонтрагентИнкассацияДенежныхСредств";
		Отказ = истина;
	КонецЕсли;	
	Если Объект.ВыбСтатьяДДС.Пустая() Тогда
		НовоеСообщение = СписокСообщений.Добавить();
		НовоеСообщение.Сообщение = НСтр("ru = 'Не заполнен реквизит ""Статья ДДС"".'");
		НовоеСообщение.Поле      = "Объект.ВыбСтатьяДДС";
		Отказ = Истина;
	КонецЕсли;
	Если Объект.ВыбКонтрагентПрочее.Пустая() Тогда
		НовоеСообщение = СписокСообщений.Добавить();
		НовоеСообщение.Сообщение = НСтр("ru = 'Не заполнен контрагент ""Прочее движение денежных средств"".'");
		НовоеСообщение.Поле      = "Объект.ВыбКонтрагентПрочее";
		Отказ = Истина;
	КонецЕсли;	
	Если Объект.ВыбКонтрагентПереводСредств.Пустая() Тогда
		НовоеСообщение = СписокСообщений.Добавить();
		НовоеСообщение.Сообщение = НСтр("ru = 'Не заполнен контрагент ""Перевод средств между счетами"".'");
		НовоеСообщение.Поле      = "Объект.ВыбКонтрагентПереводСредств";
		Отказ = Истина;
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции // ПроверитьЗаполнениеРеквизитов()

// Процедура выводит накопленные сообщения пользователи и очищает список сообщений
&НаКлиенте
Процедура ВывестиСообщения()
	
	Если СписокСообщений.Количество() > 0 Тогда
		
		Для Каждого СтрокаСообщения Из СписокСообщений Цикл
			ВывестиСообщение(СтрокаСообщения.Сообщение,ЭтотОбъект, СтрокаСообщения.Поле);		
		КонецЦикла;
		
		СписокСообщений.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРежимОбработки(РежимРаботы)
	ГруппаРежима = КоманднаяПанель.ПодчиненныеЭлементы.РежимОбработки.ПодчиненныеЭлементы;
	ГруппаРежима.ФормаНаКлиенте.Пометка = РежимРаботы;
	ГруппаРежима.ФормаНаСервере.Пометка = Не РежимРаботы;
	
	КоманднаяПанель.ПодчиненныеЭлементы.РежимОбработки.Заголовок = 
	?(РежимРаботы, НСтр("ru = 'Режим работы (на клиенте)'"), НСтр("ru = 'Режим работы (на сервере)'"));
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПредыдущееИмяФайла = Объект.ИмяФайла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ИмяФайлаТС = Неопределено Или ПустаяСтрока(Объект.ИмяФайлаТС) Тогда
		Элементы.ГруппаПанельПараметров.ТекущаяСтраница = Элементы.ТаблицаСоответствия;
		
		ПоказатьПредупреждение(,НСтр("ru = 'Перед началом загрузки, необходимо создать файл
		|для хранения таблицы соответствия объектов
		|базы - источника, объектам базы - приемника.
		|
		|Если файл таблицы соответствия существует,
		|то необходимо указать путь к данному файлу.'"),,НСтр("ru = 'ВНИМАНИЕ!'"));
		
		Элементы.кнПереиндексировать.Доступность = Ложь;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьОтчетОЗагрузкеПриИзменении(Элемент)
	
	Объект.ВыводитьКраткийОтчетОЗагрузке = Не Объект.ВыводитьПолныйОтчетОЗагрузке;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьОтчетПриИзменении(Элемент)
	
	Объект.ВыводитьКраткийОтчетОЗагрузке = ВыводитьОтчет;
	Объект.ВыводитьПолныйОтчетОЗагрузке =  ВыводитьОтчет;
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура НеОбновлятьРарусБухгалтерияПриИзменении(Элемент)
	
	Если Объект.НеОбновлятьРарусБухгалтерия = Ложь Тогда
		ВывестиСообщение(НСтр("ru = 'Внимание!
		|При сбросе флажка ""Не обновлять объекты с соответствием ТОР Раруса -> Бухгалтерия"" элементы справочников, имеющие соответствие основного направления обмена (Рарус -> Бухгалтерия), будут обновляться.
		|РЕКОМЕНДУЕТСЯ УСТАНАВЛИВАТЬ ФЛАЖОК.'"), ЭтотОбъект, "Объект.НеОбновлятьРарусБухгалтерия");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = НСтр("ru = 'Выберите файл выгрузки'") + " ...";
	ДиалогВыбора.ПолноеИмяФайла = ?(ПустаяСтрока(Объект.ИмяФайла), ПредыдущееИмяФайла, Объект.ИмяФайла);
	ДиалогВыбора.Фильтр = "Файл выгрузки в формате XML (*.xml)|download*.xml|Текстовый файл выгрузки (*.txt)|download*.txt";
	ДиалогВыбора.ПроверятьСуществованиеФайла = Истина;
	
	Если НЕ ПустаяСтрока(ДиалогВыбора.ПолноеИмяФайла) Тогда
		ТекФайл = Новый Файл(ДиалогВыбора.ПолноеИмяФайла);
		ДиалогВыбора.Каталог = ТекФайл.Путь;
		Если ТекФайл.Расширение = ".xml" Тогда
			ДиалогВыбора.Фильтр = "Файл выгрузки в формате XML (*.xml)|download*.xml|Текстовый файл выгрузки (*.txt)|download*.txt";
		КонецЕсли;
	КонецЕсли;
	
	Если ДиалогВыбора.Выбрать() Тогда
		Если Объект.ЭтоКлиент Тогда
			АдресФайла = Неопределено;
			НачатьПомещениеФайла(Новый ОписаниеОповещения("ИмяФайлаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбора", ДиалогВыбора)), АдресФайла, ДиалогВыбора.ПолноеИмяФайла, Ложь,);
			Возврат;
		КонецЕсли;
		ИмяФайлаНачалоВыбораФрагмент(АдресФайла, ДиалогВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбораЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбора = ДополнительныеПараметры.ДиалогВыбора;
	
	Если Не Результат Тогда
		ВывестиСообщение(НСтр("ru = 'Не удалось передать файл загрузки на сервер.'"),ЭтотОбъект, "Объект.ИмяФайла",,Истина);
		Возврат;
	КонецЕсли;
	
	ИмяФайлаНачалоВыбораФрагмент(Адрес, ДиалогВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбораФрагмент(Знач АдресФайла, Знач ДиалогВыбора)
	
	Если ПроверитьФайлЗагрузки(ДиалогВыбора.ПолноеИмяФайла) Тогда
		Объект.ИмяФайла = ДиалогВыбора.ПолноеИмяФайла;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяТаблицаСоответствий(Результат, Адрес, ВремяИмяФайлаТС, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		
		Объект.ИмяФайлаТС         = ВремяИмяФайлаТС;
		Объект.ИмяФайлаИндексовТС = СтрЗаменить(НРег(Объект.ИмяФайлаТС),".dbf",".cdx");
		
	Иначе
		ВывестиСообщение(НСтр("ru = 'Не удалось передать файл таблицы соответствий на сервер.'"),ЭтотОбъект, "Объект.ИмяФайлаТС",,Истина);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяТаблицаСоответствийФрагмент(Знач АдресФайла, Знач ВремяИмяФайлаТС)
	
	ПоказатьОповещениеПользователя("Ждите.",,НСтр("ru = 'Выполняется проверка таблицы соответствий'") + "...",
									БиблиотекаКартинок.ДлительнаяОперация48);

	Если Объект.ЭтоКлиент Тогда
		СтруктураИсходныхПутей = ПередатьФайлыНаСервер();
		ОткрытьФайлЗагрузкиНаСервере();
	КонецЕсли;
	
	Если ПроверитьТаблицуСоответствияНаСервере(ВремяИмяФайлаТС, Новый Структура()) Тогда
		Элементы.ГруппаПанельПараметров.ТекущаяСтраница = Элементы.Параметры;
		Элементы.кнПереиндексировать.Доступность = Истина;
	КонецЕсли;
	
	Если Объект.ЭтоКлиент Тогда
		ОбновитьФайлыНаКлиенте(СтруктураИсходныхПутей);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаТСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтруктураПроверки = Новый Структура();
	
	Если Объект.ЭтоКлиент Тогда
		СтруктураИсходныхПутей = ПередатьФайлыНаСервер();
		ОткрытьФайлЗагрузкиНаСервере();
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Объект.ИмяФайлаТС) И ПроверитьТаблицуСоответствияНаСервере(Объект.ИмяФайлаТС, СтруктураПроверки) Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, СтруктураПроверки);
		ПоказатьВопрос(Оповещение,НСтр("ru = 'Не рекомендуется изменять имя файла таблицы соответствия т.к. это может привести к потере соответствия объектов информационных баз источника и приемника.
		|Продолжить?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет, НСтр("ru = 'ВНИМАНИЕ!'"));
	Иначе
		ОткрытьДиалогВыбораФайлаТС(СтруктураПроверки);
	КонецЕсли;
	
	Если Объект.ЭтоКлиент Тогда
		ОбновитьФайлыНаКлиенте(СтруктураИсходныхПутей);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, СтруктураПроверки) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		ОткрытьДиалогВыбораФайлаТС(СтруктураПроверки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогВыбораФайлаТС(СтруктураПроверки)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.ПолноеИмяФайла = Объект.ИмяФайлаТС;
	ДиалогВыбора.Фильтр = "Файл таблицы соответствия (*.dbf)|*.dbf";
	
	Если ДиалогВыбора.Выбрать() Тогда
		
		Элементы.кнПереиндексировать.Доступность = Ложь;
		
		ВремяИмяФайлаТС = ДиалогВыбора.ПолноеИмяФайла;
		АдресФайла      = "";
		
		Если Объект.ЭтоКлиент Тогда
			НачатьПомещениеФайла(Новый ОписаниеОповещения("НоваяТаблицаСоответствий", ЭтотОбъект), АдресФайла, ВремяИмяФайлаТС, Ложь,);
		Иначе
			НоваяТаблицаСоответствийФрагмент(АдресФайла, ВремяИмяФайлаТС); 
		КонецЕсли;
		
	КонецЕсли;
	
	ВывестиСообщения();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ПустаяСтрока(Объект.ИмяФайла) Тогда Возврат; КонецЕсли;
	
	ЗапуститьПриложение(Объект.ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПанельПараметровПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ТекКнопка = Элементы.кнВыполнить;
	
	Если ТекущаяСтраница <> Элементы.ПроводитьДокументы И ПустаяСтрока(Объект.ИмяФайлаТС) Тогда
		Элементы.ГруппаПанельПараметров.ТекущаяСтраница = Элементы.ТаблицаСоответствия;
		ПоказатьПредупреждение(,НСтр("ru = 'Не указан путь к таблице соответствия.'"),,НСтр("ru = 'ВНИМАНИЕ!'"));
	Иначе
		ТекКнопка.Доступность = ?(ТекущаяСтраница = 1, Ложь, Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает надписи в зависимости от режима работы обработки и управляет видимостью элементов.
&НаКлиенте
Процедура УстановитьВидимость()
	
	ИзменитьРежимОбработки(Объект.ЭтоКлиент);
	Элементы.ВыводитьОтчетОЗагрузке.Видимость = ВыводитьОтчет;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ КЛИЕНТ-СЕРВЕРНОЙ ПЕРЕДАЧИ	

// Процедура получает файлы, измененные на сервере и по их данным обновляет исходные файлы на клиенте.
&НаКлиенте
Процедура ОбновитьФайлыНаКлиенте(СтруктураИсходныхПутей)
	
	Если Объект.ЭтоКлиент И Не ПустаяСтрока(Объект.ИмяФайлаТС) Тогда
		
		АдресФайлаТС = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Объект.ИмяФайлаТС),);
		Если СтрНайти(Объект.ИмяФайлаТС, КаталогВременныхФайлов()) > 0 Тогда
			УдалитьФайлы(Объект.ИмяФайлаТС);
		КонецЕсли;
		АдресФайлаИндексаТС = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(СтрЗаменить(НРег(Объект.ИмяФайлаТС),".dbf",".cdx")));
		Если СтрНайти(Объект.ИмяФайлаТС, КаталогВременныхФайлов()) > 0 Тогда
			УдалитьФайлы(СтрЗаменить(НРег(Объект.ИмяФайлаТС),".dbf",".cdx"));
		КонецЕсли;
		
		// Вернули исходное имя файла в обработку
		Если СтруктураИсходныхПутей.Свойство("ФайлНаКлиенте") Тогда
			Объект.ИмяФайла   = СтруктураИсходныхПутей.ФайлНаКлиенте; 
		КонецЕсли;
		Если СтруктураИсходныхПутей.Свойство("ФайлТСНаКлиенте") Тогда
			Объект.ИмяФайлаТС = СтруктураИсходныхПутей.ФайлТСНаКлиенте;
		КонецЕсли;
		Если СтруктураИсходныхПутей.Свойство("ФайлИндексовТСНаКлиенте") Тогда
			Объект.ИмяФайлаИндексовТС = СтруктураИсходныхПутей.ФайлИндексовТСНаКлиенте;
		КонецЕсли;
		// Передадим файл соответствий обратно на клиента
		Если СтруктураИсходныхПутей.Свойство("ФайлТСНаКлиенте") Тогда
			ПолучитьФайл(АдресФайлаТС,        СтруктураИсходныхПутей.ФайлТСНаКлиенте, Ложь);
			ПолучитьФайл(АдресФайлаИндексаТС, СтруктураИсходныхПутей.ФайлИндексовТСНаКлиенте, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПереиндексироватьНаСервере(СтруктураПроверки)
	
	Если ПроверитьТаблицуСоответствияНаСервере(Объект.ИмяФайлаТС, СтруктураПроверки, Истина).Результат Тогда
		Попытка СтруктураПроверки.БД_ТС.Переиндексировать();
		Исключение
			СписокСообщений.Очистить();
			НовоеСообщение = СписокСообщений.Добавить();
			НовоеСообщение.Сообщение = НСтр("ru = 'ВНИМАНИЕ! Не удалось переиндексировать таблицу соответствия:'" + Символы.НПП + Объект.ИмяФайлаТС + ОписаниеОшибки());
			НовоеСообщение.Поле      = "Объект.ИмяФайлаТС";
		КонецПопытки;
	КонецЕсли;
	СтруктураПроверки.Удалить("БД_ТС");
	
КонецПроцедуры

// Процедура создает на сервере файлы, переданные с клиента
&НаСервере
Процедура ОткрытьФайлЗагрузкиНаСервере()
	
	Если Объект.ЭтоКлиент Тогда
		
		Если ЗначениеЗаполнено(Объект.ИмяФайла) Тогда
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(Объект.ИмяФайла);
			АдресНаСервере = ПолучитьИмяВременногоФайла(".xml");
			ДвоичныеДанные.Записать(АдресНаСервере);
			Объект.ИмяФайла = АдресНаСервере;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ИмяФайлаТС) Тогда
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(Объект.ИмяФайлаТС);
			// evstta: имя файла не может быть длиннее 8 символов
			ГСЧ = Новый ГенераторСлучайныхЧисел();
			ИмяВременногоФайла = ГСЧ.СлучайноеЧисло(0, 99999999);
			ИмяВременногоФайла = Формат(ИмяВременногоФайла, "ЧЦ=8; ЧДЦ=; ЧВН=; ЧГ=0");
			АдресНаСервере = КаталогВременныхФайлов() + ИмяВременногоФайла + ".dbf";
			ДвоичныеДанные.Записать(АдресНаСервере);
			Объект.ИмяФайлаТС = АдресНаСервере;
		КонецЕсли;
		
		Если Объект.ИмяФайлаИндексовТС<>"" Тогда
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(Объект.ИмяФайлаИндексовТС);
			// Временное имя нам не подходит потому что оно длиннее 8 символов
			АдресНаСервере = КаталогВременныхФайлов() + ИмяВременногоФайла +".CDX";
			ДвоичныеДанные.Записать(АдресНаСервере);
			Объект.ИмяФайлаИндексовТС = АдресНаСервере;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПередатьФайлыНаСервер()
	
	СтруктураВозврата = Новый Структура;
	
	ДополнительныеПараметры = Новый Структура();
	
	Если Не ПустаяСтрока(Объект.ИмяФайла) Тогда
		ДополнительныеПараметры.Вставить("ТипФайла",     НСтр("ru = 'файл загрузки'"));
		ДополнительныеПараметры.Вставить("ИмяРеквизита", "ИмяФайла");
	
		СтруктураВозврата.Вставить("ФайлНаКлиенте", Объект.ИмяФайла); 
		НачатьПомещениеФайла(Новый ОписаниеОповещения("ПослеПередачиФайловНаСервер", ЭтотОбъект, ДополнительныеПараметры), , Объект.ИмяФайла, Ложь, УникальныйИдентификатор);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Объект.ИмяФайлаТС) Тогда
		ДополнительныеПараметры.Вставить("ТипФайла",      НСтр("ru = 'файл соответствий'"));
		ДополнительныеПараметры.Вставить("ИмяРеквизита",  "ИмяФайлаТС");
	
		СтруктураВозврата.Вставить("ФайлТСНаКлиенте", Объект.ИмяФайлаТС); 
		НачатьПомещениеФайла(Новый ОписаниеОповещения("ПослеПередачиФайловНаСервер", ЭтотОбъект, ДополнительныеПараметры), , Объект.ИмяФайлаТС, Ложь, УникальныйИдентификатор);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Объект.ИмяФайлаИндексовТС) Тогда
		ДополнительныеПараметры.Вставить("ТипФайла",      НСтр("ru = 'файл индекса соответствий'"));
		ДополнительныеПараметры.Вставить("ИмяРеквизита",  "ИмяФайлаИндексовТС");
	
		СтруктураВозврата.Вставить("ФайлИндексовТСНаКлиенте", Объект.ИмяФайлаИндексовТС); 
		НачатьПомещениеФайла(Новый ОписаниеОповещения("ПослеПередачиФайловНаСервер", ЭтотОбъект, ДополнительныеПараметры), , Объект.ИмяФайлаИндексовТС, Ложь, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ПослеПередачиФайловНаСервер(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры)
	
	Если Результат Тогда
		Объект[ДополнительныеПараметры.ИмяРеквизита] = Адрес;
	Иначе
		ВывестиСообщение(НСтр("ru = 'Не удалось передать %1  на сервер.'"),ЭтотОбъект, Объект[ДополнительныеПараметры.ИмяРеквизита],,Истина, ДополнительныеПараметры.ТипФайла);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура-обработчик изменения клиент-серверного режима обработки
&НаКлиенте
Процедура НаКлиенте(Команда)
	Если НЕ Объект.ЭтоКлиент Тогда
		Объект.ЭтоКлиент = Истина;
		ИзменитьРежимОбработки(Объект.ЭтоКлиент);
	КонецЕсли;
КонецПроцедуры

// Процедура-обработчик изменения клиент-серверного режима обработки.
&НаКлиенте
Процедура НаСервере(Команда)
	Если Объект.ЭтоКлиент Тогда
		Объект.ЭтоКлиент = Ложь;
		ИзменитьРежимОбработки(Объект.ЭтоКлиент);
	КонецЕсли;
КонецПроцедуры

// Процедура создает новую таблицу соответствий.
&НаКлиенте
Процедура кнНовая(Команда)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.ПолноеИмяФайла = Объект.ИмяФайлаТС;
	
	Если ДиалогВыбора.Выбрать() Тогда
		ВремяИмяФайлаТС = ДиалогВыбора.Каталог + "\ts.dbf";		
		// Если такие файлы существуют, то их нужно удалить.
		Если НайтиФайлы(ДиалогВыбора.Каталог + "\ts.dbf").Количество() > 0 Тогда
			УдалитьФайлы(ДиалогВыбора.Каталог + "\ts.dbf");
		КонецЕсли;
		
		Если НайтиФайлы(ДиалогВыбора.Каталог + "\ts.cdx").Количество() > 0 Тогда
			УдалитьФайлы(ДиалогВыбора.Каталог + "\ts.cdx");			
		КонецЕсли;		
		
		АдресФайла = Неопределено;
		
		НоваяТаблицаСоответствийФрагмент(АдресФайла, ВремяИмяФайлаТС); 

		Если Объект.ЭтоКлиент Тогда
			НачатьПомещениеФайла(Новый ОписаниеОповещения("НоваяТаблицаСоответствий", ЭтотОбъект), АдресФайла, ВремяИмяФайлаТС, Ложь,);
			Возврат;
		КонецЕсли;
		
		Элементы.ГруппаПанельПараметров.ТекущаяСтраница = Элементы.Параметры;
		
	КонецЕсли;
	
	ВывестиСообщения();
	
КонецПроцедуры

// Процедура переиндексирования указанной таблицы соответствий.
&НаКлиенте
Процедура кнПереиндексировать(Команда)
	
	СтруктураПроверки = Новый Структура();
	
	ПоказатьОповещениеПользователя("Ждите",, НСтр("ru = 'Идет переиндексация файла таблицы соответствия'") + "...",
										БиблиотекаКартинок.ДлительнаяОперация48);
	
	Если Объект.ЭтоКлиент Тогда
		СтруктураИсходныхПутей = ПередатьФайлыНаСервер();
		ОткрытьФайлЗагрузкиНаСервере();
	КонецЕсли;
	
	ПереиндексироватьНаСервере(СтруктураПроверки);
	
	Если Объект.ЭтоКлиент Тогда
		ОбновитьФайлыНаКлиенте(СтруктураИсходныхПутей);		
	КонецЕсли;
	
	
	ВывестиСообщения();
	
КонецПроцедуры 

&НаКлиенте
Процедура кнВыполнить(Команда)
	
	СтруктураПроверки = Новый Структура();
	
	ПоказатьОповещениеПользователя("Ждите.",,НСтр("ru = 'Идет проверка формата файла'") + " ...", 
										БиблиотекаКартинок.ДлительнаяОперация48);
	
	// Надо передать файлы на сервер для проверки таблицы соответствия.
	Если Объект.ЭтоКлиент Тогда
		СтруктураИсходныхПутей = ПередатьФайлыНаСервер();
		ОткрытьФайлЗагрузкиНаСервере();
	КонецЕсли;
	
	Если НЕ ПроверитьТаблицуСоответствияНаСервере(Объект.ИмяФайлаТС, СтруктураПроверки, Ложь) Тогда 
		Возврат; 
	КонецЕсли;
	
	// Надо обновить файл таблицы соответствия на клиенте, он мог быть изменен при проверке.
	Если Объект.ЭтоКлиент Тогда
		ОбновитьФайлыНаКлиенте(СтруктураИсходныхПутей);
	КонецЕсли;
	
	// Теперь надо передать файлы на сервер, чтобы выполнить основные действия.
	Если Объект.ЭтоКлиент Тогда
		СтруктураИсходныхПутей = ПередатьФайлыНаСервер();
		ОткрытьФайлЗагрузкиНаСервере();
	КонецЕсли;
	
	ВывестиСообщения();
	
	Если НЕ ПроверитьФайлЗагрузки(Объект.ИмяФайла) Тогда 
		Возврат; 
	КонецЕсли;
	
	ПоказатьОповещениеПользователя("Ждите.",, НСтр("ru = 'Идет просмотр файла выгрузки'") + " ....", 
									БиблиотекаКартинок.ДлительнаяОперация48);
	
	кнВыполнитьНаСервере(Объект.ИмяФайлаТС);
	
	ОбновитьФайлыНаКлиенте(СтруктураИсходныхПутей);
	
	ПоказатьОповещениеПользователя(,,НСтр("ru = 'Обработка завершена'"), БиблиотекаКартинок.Успешно);
	
	ВывестиСообщения();
	
	Если Объект.ПоказатьЗагруженные Тогда
		ОткрытьФорму("Обработка.ЗагрузкаДанныхБух.Форма.ЗагруженныеОбъекты", Новый Структура("ОбработанныеОбъекты", ОбработанныеОбъекты),ЭтотОбъект);
	КонецЕсли;	
	
	Если Объект.ВыводитьПолныйОтчетОЗагрузке ИЛИ Объект.ВыводитьКраткийОтчетОЗагрузке Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("НачалоРаботы",                 НачалоРаботы);
		ПараметрыФормы.Вставить("ОкончаниеРаботы",              ОкончаниеРаботы);
		ПараметрыФормы.Вставить("ТаблицаОтчета",                ТаблицаОтчета);
		ПараметрыФормы.Вставить("СтрокаЗагрузки",               СтрокаЗагрузки);
		ПараметрыФормы.Вставить("ВыводитьПолныйОтчетОЗагрузке", Объект.ВыводитьПолныйОтчетОЗагрузке);
		ПараметрыФормы.Вставить("ИмяФайла",                     ?(Объект.ЭтоКлиент, СтруктураИсходныхПутей.ФайлНаКлиенте, Объект.ИмяФайла));
		ОткрытьФорму("Обработка.ЗагрузкаДанныхБух.Форма.ОтчетЗагрузки", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура кнВыполнитьНаСервере(АдресФайлаТС)
	
	ПрекратитьЗагрузку = Ложь;
	ТаблицаОтчета.Очистить();
	
	Отказ = Ложь;
	Менеджер = Справочники.Организации;
	ТекОбъект = Менеджер.ПустаяСсылка();
	Если НЕ ПолучитьСоответствиеНаСервере(Менеджер, ВыбОрганизацияИсточник, ТекОбъект) Тогда
		НовоеСообщение = СписокСообщений.Добавить();
		НовоеСообщение.Сообщение = НСтр("ru = 'Нет соответствия у организации выгрузки, сначала нужно провести обмен ТОР Раруса -> Бухгалтерия для установки соответствия организаций.'");
		НовоеСообщение.Поле = "";
		Отказ = Истина;
	КонецЕсли;
	Если ТекОбъект <> Неопределено И НЕ ТекОбъект.Ссылка.Пустая() И НЕ Объект.ВыбПодразделение.Пустая() И Объект.ВыбПодразделение.Организация <> ТекОбъект.Ссылка Тогда
		СписокСообщений.Добавить(НСтр("ru = 'Выбранное подразделение не является подразделением организации'"+ ТекОбъект));
		Отказ = Истина;
	КонецЕсли;	
	Если Объект.кУР И ПустаяСтрока(Объект.ВидУчета) Тогда
		НовоеСообщение = СписокСообщений.Добавить();
		НовоеСообщение.Сообщение = НСтр("ru = 'При выгрузке не был указан вид учета. Загрузка невозможна.'");
		НовоеСообщение.Поле = "";
		Отказ = Истина;		
	КонецЕсли;	
	Если НЕ ПроверитьЗаполнениеРеквизитов() Тогда
		Отказ = Истина;
	КонецЕсли;	
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;	
	
	ОбщиеПараметры = Новый Структура;
	ОбщиеПараметры.Вставить("ДобавленаИнформацияОЗагрузке");
	
	НачалоРаботы = ТекущаяДатаСеанса();
	Объект.ЗагруженоСпр = 0; Объект.ЗагруженоДок = 0;
	
	ФайлЗагрузки = Новый ЧтениеXML();
	ФайлЗагрузки.ОткрытьФайл(Объект.ИмяФайла);
	
	ДеревоВыгруженныхОбъектов = РеквизитФормыВЗначение("ОбработанныеОбъекты");
	
	Если Объект.ПоказатьЗагруженные Тогда
		ДеревоВыгруженныхОбъектов.Колонки.Очистить();
		ДеревоВыгруженныхОбъектов.Строки.Очистить();
		
		ЧисловойТип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19, 3));
		
		ДеревоВыгруженныхОбъектов.Колонки.Добавить("ОбъектИсточник");
		ДеревоВыгруженныхОбъектов.Колонки.Добавить("Количество", ЧисловойТип);
		ДеревоВыгруженныхОбъектов.Колонки.Добавить("ТипОбъекта");
		ДеревоВыгруженныхОбъектов.Колонки.Добавить("ОбъектПриемник");
		
		КореньСправочники = ДеревоВыгруженныхОбъектов.Строки.Добавить();
		КореньСправочники.ОбъектИсточник = "Справочники";
		
		КореньДокументы = ДеревоВыгруженныхОбъектов.Строки.Добавить();
		КореньДокументы.ОбъектИсточник = "Документы";
	КонецЕсли;
	
	Результат = Обработки.ЗагрузкаДанныхБух.ОбновитьДанныеВыгрузки(Объект, СписокСообщений, ФайлЗагрузки, КореньДокументы, КореньСправочники, ПрекратитьЗагрузку);
	
	Если НЕ Результат.ПрекратитьЗагрузку Тогда 
		Обработки.ЗагрузкаДанныхБух.ЗагрузитьВыписку(Новый Структура("КореньДокументы, КореньСправочники", КореньДокументы, КореньСправочники), Новый Массив);
	КонецЕсли;   // Загрузим выписки
	
	Обработки.ЗагрузкаДанныхБух.ДобавитьВТаблицуОтчета(Результат.ПромежуточнаяТаблицаОтчета, Результат.ТаблицаОтчета);
	
	ЗначениеВДанныеФормы(ДеревоВыгруженныхОбъектов, ОбработанныеОбъекты);
	
	ОкончаниеРаботы = ТекущаяДатаСеанса();
	Если Объект.ЗагруженоСпр + Объект.ЗагруженоДок > 0 Тогда
		НовоеСообщение = СписокСообщений.Добавить();
		СтрокаЗагрузки = "  " +  НСтр("ru = 'Начало работы'") + " - " + НачалоРаботы +", " + НСтр("ru = 'окончание работы'") + " - " + ОкончаниеРаботы + "
		|  " + НСтр("ru = 'Всего обработано объектов:'") + " " + (Объект.ЗагруженоСпр + Объект.ЗагруженоДок) + " (" +НСтр("ru = 'из них: элементов справочников'") + " - " + Объект.ЗагруженоСпр + " , " + НСтр("ru = 'документов'") + " - " + Объект.ЗагруженоДок + ")";
		НовоеСообщение.Поле = "";
		НовоеСообщение.Сообщение = СтрокаЗагрузки; 
	КонецЕсли;
	ТаблицаСообщений = СписокСообщений.Выгрузить();
	ТаблицаСообщений.Свернуть("Сообщение, Поле");
	СписокСообщений.Загрузить(ТаблицаСообщений);
	ТаблицаОтчета.Загрузить(Результат.ТаблицаОтчета);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАБОТЫ С ТАБЛИЦЕЙ СООТВЕТСТВИЯ

&наСервере
Функция ПолучитьСоответствиеНаСервере(Менеджер, ВыбОрганизацияИсточник, ТекОбъект)
	
	Результат = Обработки.ЗагрузкаДанныхБух.ПолучитьСоответствие(Менеджер, ВыбОрганизацияИсточник, ТекОбъект, Объект.ИмяФайлаТС, Объект.ЭтоКлиент);
	Возврат Результат;
	
КонецФункции

// Проверяет файл на возможность чтения и сообщает об ошибках
// Параметры:
//	ИмяФайлаПроверки - имя файла проверки.
//
// Возвращает Истина если все в порядке, иначе Ложь.
//
&НаКлиенте
Функция ПроверитьФайлЗагрузки(ИмяФайлаПроверки) Экспорт
	
	ПоказатьОповещениеПользователя("Ждите",, НСтр("ru = 'Идет проверка формата файла'") + " ...",БиблиотекаКартинок.ДлительнаяОперация48);
	
	Если ПустаяСтрока(ИмяФайлаПроверки) Тогда
		ВывестиСообщение(НСтр("ru = 'Не указано имя файла загрузки'"),ЭтотОбъект, "Объект.ИмяФайла",,Истина);
		Возврат Ложь;
	КонецЕсли;
	
	ИдентификаторИБИсточника   = "";
	Объект.XMLФорматВыгрузки = Ложь;
	Объект.ФайлВыгрузкиИзV8  = Истина;	
	ЗаголовокВыгрузки = "";
	Объект.ВидУчета = "";
	
	ФайлЗагрузки = Новый Файл(ИмяФайлаПроверки);
	Если НРег(ФайлЗагрузки.Расширение) = ".xml" Тогда
		Объект.XMLФорматВыгрузки = Истина;
		
		Попытка
			ФайлЗагрузки = Новый ЧтениеXML();
			ФайлЗагрузки.ОткрытьФайл(ИмяФайлаПроверки);
			
			ФайлЗагрузки.Прочитать();			
			
			НачалоПериодаВыгрузки = ФайлЗагрузки.ПолучитьАтрибут("НачалоПериода");
			КонецПериодаВыгрузки  = ФайлЗагрузки.ПолучитьАтрибут("КонецПериода");
			Если ПустаяСтрока(НачалоПериодаВыгрузки) И ПустаяСтрока(КонецПериодаВыгрузки) Тогда
				ТекстПериодаВыгрузки  = НСтр("ru = 'за все существующие периоды'");
				
			ИначеЕсли ПустаяСтрока(НачалоПериодаВыгрузки) Тогда
				ТекстПериодаВыгрузки  = НСтр("ru = 'с начала ведения учета по'") + " " + КонецПериодаВыгрузки;
				
			ИначеЕсли ПустаяСтрока(КонецПериодаВыгрузки) Тогда
				ТекстПериодаВыгрузки  = "с" + " " + НачалоПериодаВыгрузки;
				
			Иначе
				ТекстПериодаВыгрузки  = "с" + " " + НачалоПериодаВыгрузки + " " + "по" + " " + КонецПериодаВыгрузки;
				
			КонецЕсли;
			
			ИдентификаторИБИсточника = ФайлЗагрузки.ПолучитьАтрибут("Конфигурация");			
			Объект.флЗагрузкаИзБП2 = ?(СтрНайти(ВРег(ИдентификаторИБИсточника),"КОРП")>0,1,?(СтрНайти(ВРег(ИдентификаторИБИсточника),"РЕДАКЦИЯ 2.0")>0,2,0));
			СтрокаОписанияКонфигурации = НСтр("ru = 'Конфигурация:'") + " <" + ИдентификаторИБИсточника + ">," 
										+ НСтр("ru = 'файл создан:'") + " " + ФайлЗагрузки.ПолучитьАтрибут("ДатаВыгрузки") 
										+ ?(Объект.ФайлВыгрузкиИзV8, "", " " + ФайлЗагрузки.ПолучитьАтрибут("ВремяВыгрузки"))+ ". " 
										+ НСтр("ru = 'Период выгрузки:'") + " <" + ТекстПериодаВыгрузки + ">";
			
			Если Объект.флЗагрузкаИзБП2 > 0 Тогда
				
				Если Объект.СоответствиеМенеджеров.НайтиПоЗначению("ПлатежноеПоручениеВходящее") <> Неопределено Тогда
					Объект.СоответствиеМенеджеров.Удалить(Объект.СоответствиеМенеджеров.НайтиПоЗначению("ПлатежноеПоручениеВходящее"));
				КонецЕсли;
				
				Если Объект.СоответствиеМенеджеров.НайтиПоЗначению("ПлатежноеПоручениеИсходящее") <> Неопределено Тогда
					Объект.СоответствиеМенеджеров.Удалить(Объект.СоответствиеМенеджеров.НайтиПоЗначению("ПлатежноеПоручениеИсходящее"));
				КонецЕсли;
				
				Если Объект.СоответствиеМенеджеров.НайтиПоЗначению("ПоступлениеНаРасчетныйСчет") = Неопределено Тогда
					Объект.СоответствиеМенеджеров.Добавить("ПоступлениеНаРасчетныйСчет",	"Выписка");
				КонецЕсли;
				
				Если Объект.СоответствиеМенеджеров.НайтиПоЗначению("СписаниеСРасчетногоСчета") = Неопределено Тогда
					Объект.СоответствиеМенеджеров.Добавить("СписаниеСРасчетногоСчета",	"Выписка");
				КонецЕсли;
				
			Иначе
				
				Если Объект.СоответствиеМенеджеров.НайтиПоЗначению("ПоступлениеНаРасчетныйСчет") <> Неопределено Тогда
					Объект.СоответствиеМенеджеров.Удалить(Объект.СоответствиеМенеджеров.НайтиПоЗначению("ПоступлениеНаРасчетныйСчет"));
				КонецЕсли;
				
				Если Объект.СоответствиеМенеджеров.НайтиПоЗначению("СписаниеСРасчетногоСчета") <> Неопределено Тогда
					Объект.СоответствиеМенеджеров.Удалить(Объект.СоответствиеМенеджеров.НайтиПоЗначению("СписаниеСРасчетногоСчета"));
				КонецЕсли;
				
				Если Объект.СоответствиеМенеджеров.НайтиПоЗначению("ПлатежноеПоручениеВходящее") <> Неопределено Тогда
					Объект.СоответствиеМенеджеров.Удалить(Объект.СоответствиеМенеджеров.НайтиПоЗначению("ПлатежноеПоручениеВходящее"));
				КонецЕсли;
				
				Если Объект.СоответствиеМенеджеров.НайтиПоЗначению("ПлатежноеПоручениеВходящее") = Неопределено Тогда
					Объект.СоответствиеМенеджеров.Добавить("ПлатежноеПоручениеВходящее",	"Выписка");
				КонецЕсли;
				
				Если Объект.СоответствиеМенеджеров.НайтиПоЗначению("СписаниеСРасчетногоСчета") = Неопределено Тогда
					Объект.СоответствиеМенеджеров.Добавить("СписаниеСРасчетногоСчета",	"Выписка");
				КонецЕсли;
				
			КонецЕсли;			
			
			ВыбОрганизацияИсточник = ФайлЗагрузки.ПолучитьАтрибут("Организация");
			ЗаголовокВыгрузки      = ФайлЗагрузки.ПолучитьАтрибут("Заголовок");
			Объект.ВидУчета        = ФайлЗагрузки.ПолучитьАтрибут("ВидУчета");
			
		Исключение
			ВывестиСообщение(НСтр("ru = 'Не удалось прочитать данные из файла: %1
			|Ошибка: %2'"),ЭтотОбъект, "Объект.ИмяФайла",, Истина, ИмяФайлаПроверки, ОписаниеОшибки()); 
			Возврат Ложь;
		КонецПопытки;
		
	ИначеЕсли НРег(ФайлЗагрузки.Расширение) = ".txt" Тогда
		Попытка
			ФайлЗагрузки = Новый ТекстовыйДокумент();
			ФайлЗагрузки.Прочитать(ИмяФайлаПроверки);
			
			ЗначенияСтроки = РазобратьСтрокуНаСервере(ФайлЗагрузки.ПолучитьСтроку(1));
			ЗаголовокФайла = ЗначенияСтроки.Получить(0).Значение;
			
			
			Объект.ФайлВыгрузкиИзV8 = Истина;			
			
			НачалоПериодаВыгрузки = ЗаголовокФайла.Получить(1).Значение;
			КонецПериодаВыгрузки  = ЗаголовокФайла.Получить(2).Значение;
			
			
			Если ПустаяСтрока(СтрЗаменить(НачалоПериодаВыгрузки, ".", "")) И ПустаяСтрока(СтрЗаменить(КонецПериодаВыгрузки, ".", "")) Тогда
				ТекстПериодаВыгрузки  = НСтр("ru = 'за все существующие периоды'");
				
			ИначеЕсли ПустаяСтрока(СтрЗаменить(НачалоПериодаВыгрузки, ".", "")) Тогда
				ТекстПериодаВыгрузки  = НСтр("ru = 'с начала ведения учета по'") + " " + КонецПериодаВыгрузки;
				
			ИначеЕсли ПустаяСтрока(СтрЗаменить(КонецПериодаВыгрузки, ".", "")) Тогда
				ТекстПериодаВыгрузки  = "с" + " " + НачалоПериодаВыгрузки;
				
			Иначе
				ТекстПериодаВыгрузки  = "с" + " " + НачалоПериодаВыгрузки + " " + "по" + " " + КонецПериодаВыгрузки;
				
			КонецЕсли;
			
			ИдентификаторИБИсточника = ОчиститьСпецСимволыНаСервере(ЗаголовокФайла.Получить(0).Значение);
			
			СтрокаОписанияКонфигурации = НСтр("ru = 'Конфигурация:'") + " <" + ИдентификаторИБИсточника + " >, " + НСтр("ru = 'файл создан:'") + " " 
										+ ЗаголовокФайла.Получить(1).Значение 
										+ ". " + НСтр("ru = 'Период выгрузки:'") + " <" + ТекстПериодаВыгрузки + ">";
			
			ЗаголовокВыгрузки = ЗаголовокФайла.Получить(4).Значение;
			ВыбОрганизацияИсточник = ЗаголовокФайла.Получить(5).Значение;
			Объект.ВидУчета = ЗаголовокФайла.Получить(6).Значение;
			
		Исключение
			ВывестиСообщение(НСтр("ru = 'Не удалось прочитать данные из файла: %1
			|Ошибка: %2'"),ЭтотОбъект, "Объект.ИмяФайла",,Истина,ИмяФайлаПроверки, ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;	
		
	Иначе
		ВывестиСообщение(НСтр("ru = 'Не известное расширение файла.'"), ЭтотОбъект, "Объект.ИмяФайла",,Истина);
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗаголовокВыгрузки <> "ВыгрузкаИзБухгалтерии" Тогда
		ВывестиСообщение(НСтр("ru = 'Неверный файл выгрузки.'"), ЭтотОбъект, "Объект.ИмяФайла",,Истина);
		Возврат Ложь;
	КонецЕсли;		
	
	Если ВыбОрганизацияИсточник = "" ИЛИ ВыбОрганизацияИсточник = Неопределено Тогда
		ВывестиСообщение(НСтр("ru = 'Не указана организация выгрузки.'"), ЭтотОбъект, "Объект.ИмяФайла",,Истина);
		Возврат Ложь;
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции	//	ПроверитьФайлЗагрузки()

&НаСервере
Функция ПроверитьТаблицуСоответствияНаСервере(ИмяФайлаТС, СтруктураПроверки, ЭтоПереиндексировать = Ложь)
	
	Результат = Обработки.ЗагрузкаДанныхБух.ПроверитьТаблицуСоответствия(Объект.ИмяФайлаТС, СписокСообщений, Объект.БылоСозданиеНовогоПоля, Объект);
	
	Если ЭтоПереиндексировать Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		СтруктураПроверки.Вставить("БД_ТС", ОбработкаОбъект.БД_ТС);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
